Simulación/CFD_DEM/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 129.448;

boundaryField
{
    defaultFaces
    {
        type            omegaWallFunction;
        value           uniform 129.448;
    }

    ingreso
    {
        type            zeroGradient;
    }

    salida
    {
        type            zeroGradient;
    }

    back
    {
        type            empty;
    }
    
    front
    {
        type            empty;
    }
}

// ************************************************************************* //
