Simulación/CFD_DEM/constant/kinematicCloudProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      kinematicCloudProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution
{
    active          true;
    coupled         true;
    transient       yes;
    cellValueSourceCorrection off;
    maxCo           0.3; 

    interpolationSchemes
    {
        rho             cell;
        U               cell;
        mu              cell;
        DUcDt           cell;
    }

    integrationSchemes
    {
        U               Euler;
    }

    sourceTerms
    {
        schemes
        {
            U           semiImplicit 1;
        }
    }
}

constantProperties
{
    rho0            1600;
    youngsModulus   10e6;
    poissonsRatio   0.2;
}

subModels
{
    particleForces
    {
        sphereDrag;
        
        gravity;
        
        pressureGradient
        {
            U U;
        }

    }

    injectionModels
    {
	model1
	{
            type             patchInjection;
            patchName        ingreso;
            duration         60;
	    parcelsPerSecond 16000;
            massTotal        0;
            parcelBasisType  fixed;
            flowRateProfile  constant 1;
            nParticle        1;
            SOI              0.4;
            U0               (0.015 0 0);
            sizeDistribution
            {
                type        fixedValue;
                fixedValueDistribution
                {
                    value   0.00025;
                }
            }
        }
    }

    dispersionModel none;

    patchInteractionModel standardWallInteraction;

    standardWallInteractionCoeffs
    {
        type rebound;
        e    0.97;
        mu   0.09;
    }

    surfaceFilmModel none;

    stochasticCollisionModel none;
    
    collisionModel none;    

    pairCollisionCoeffs
    {
        maxInteractionDistance  0.00025;

        writeReferredParticleCloud no;

        pairModel pairSpringSliderDashpot;

        pairSpringSliderDashpotCoeffs
        {
            useEquivalentSize   no;
            alpha               0.12;
            b                   1.5;
            mu                  0.52;
            cohesionEnergyDensity 0;
            collisionResolutionSteps 12;
        };
        
        wallModel wallSpringSliderDashpot;

        wallSpringSliderDashpotCoeffs
        {
            useEquivalentSize no;
            collisionResolutionSteps 12;
            youngsModulus   1e10;
            poissonsRatio   0.23;
            alpha           0.12;
            b               1.5;
            mu              0.43;
            cohesionEnergyDensity 0;
        };
    }
}

cloudFunctions
{
    voidFraction1
    {
        type            voidFraction;
    }
}

// ************************************************************************* //
