Simulación/CFD_DEM/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    back
    {
        type            empty;
        nFaces          5101;
        startFace       9107;
    }
    front
    {
        type            empty;
        nFaces          5101;
        startFace       14208;
    }
    ingreso
    {
        type            patch;
        nFaces          14;
        startFace       19309;
    }
    salida
    {
        type            patch;
        nFaces          20;
        startFace       19323;
    }
    defaultFaces
    {
        type            wall;
        nFaces          1211;
        startFace       19343;
    }
)

// ************************************************************************* //
